[{"article_id":9,"post_time":1422488900,"portrait_file":"farm.png","nickname":"Ben","article_title":"More Progress!","article_text":"The website has now transitioned fully over to AngularJS. Why? It's not perfect, as is the case with any web development platform, but it is well supported and takes care of the messy AJAX side of things nicely. That said, I hear AngularJS 2.0 is on the way, and I will almost certainly feel the urge to update the website accordingly (whether or not I should). In other news, the game development side of things is about to get back on track, with the bulk of website design out of the way. For once, something more than just Ludum Dare games will grace these halls."},
 {"article_id":8,"post_time":1412725941,"portrait_file":"me.png","nickname":"Ben","article_title":"Progress!","article_text":"I've finally fixed up the website to a semi-functional state again, in a new-much-more-tweakable framework. It's maybe a little disappointing that most of what I've been up to is tweaking, but overall it's amazing how easy web development has become over recent years. Compared to how it used to be at least - it's still a beast. I'm only at the tip of the iceberg, really, but I'm happy being there."},
 {"article_id":7,"post_time":1407968548,"portrait_file":"farm.png","nickname":"Ben","article_title":"Working on some upgrades","article_text":"I'm going to be making this website more than the current mess it is in the evenings."},
 {"article_id":6,"post_time":1404596227,"portrait_file":"me.png","nickname":"Ben","article_title":"Welcome to the Sleep Zone","article_text":"So it begins."},
 {"article_id":1,"post_time":1450227225,"portrait_file":"farm.png","nickname":"Ben","article_title":"More Website Dev. Games? What Games?","article_text":"Hey look, security! That's right, I've got SSL working now, thanks to a new friendly neighborhood CA going by the name of \"Let's Encrypt\". Not a big fan of the name, but I certainly approve of what they're doing.  For those not in the know, they're offering free SSL certificates and a command line tool to help install them. Handy.\n\nOkay, plug over (and no, they're not paying me to say nice things about them, if only). Years ago, when I was naught more than a mere lad, I used to think SSL could encrypt your data even past the point the server gets it, but that's just silly. The server of course can read your messages, that's the whole point. So remember kids, don't send sensitive data to a sketchy website even if it has that https thing going on. Who knows what they'll do with it!\n\nI've been quiet for a while, mainly because to write these articles before I was manually inserting into the database. Now I'm doing it in a slightly better way with some homemade tooling, so that's good."},
 {"article_id":11,"post_time":1433524698,"portrait_file":"farm.png","nickname":"Ben","article_title":"Engine Choice","article_text":"One might look at the choice of game engines as a tradeoff, as is the case with so many things. I've decided that robust, full-bodied engines (which perhaps offer less creative flexibility) are better for me at the moment. I'm decent at coding, if only reasonably. I can make cool things happen. What I can't do is make cool things happen quickly, at least when working with code at a low level. So, if one wants to finish \"big\" games, one can't mess about with the small stuff. Still, there's something to said for more flexible, customizable approaches. The most interesting games live on the edges of the possibility space of game design, and the possibility space is part technical, part creative. An engine which excels at technical tasks tends to limit the creative potentials of games made in it (though maybe only because it encourages certain kinds of games). The opposite is also true. The trick is finding a balance, and one that matches the development style of the team involved. You can think of the creative parts and technical parts multiplying by each other to give an end result - if either was is sub-par, it brings down the whole. In any case, I hope to get more done in the coming months, with a focus on keeping things interesting (even if they aren't impressive). For all of you who play these things. We'll see!"},
 {"article_id":10,"post_time":1429218521,"portrait_file":"me.png","nickname":"Ben","article_title":"More More Progress!","article_text":"Well, it's been slower going as of late, but I'm glad to announce that Schema Games now has Things. With a capital T. Which has been a link on the sidebar for much longer than there have actually been any things to speak of. So hooray! The website's been getting other tweaks too, with more incoming. When I'm \"done\", I think that it will be a good time to take a break and come back to make games and things for perusal. Keep your eyes on the vine, and your grapes peeled!"}]